nbd_fio_results/dev-nbd0_2023-07-17_17:16/rand_r_nbd0_4iodepth_1threads/8192.txt
rand-read: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=4
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=15670: Mon Jul 17 17:29:53 2023
   read: IOPS=167, BW=1343MiB/s (1409MB/s)(26.3GiB/20020msec)
    slat (usec): min=113, max=3630, avg=276.62, stdev=136.68
    clat (usec): min=9532, max=36004, avg=23522.49, stdev=2370.50
     lat (usec): min=12274, max=36124, avg=23799.75, stdev=2367.12
    clat percentiles (usec):
     |  1.00th=[17433],  5.00th=[17695], 10.00th=[23200], 20.00th=[23200],
     | 30.00th=[23462], 40.00th=[23462], 50.00th=[23462], 60.00th=[23462],
     | 70.00th=[23725], 80.00th=[23725], 90.00th=[23987], 95.00th=[29230],
     | 99.00th=[29754], 99.50th=[30540], 99.90th=[35390], 99.95th=[35914],
     | 99.99th=[35914]
   bw (  MiB/s): min= 1312, max= 1360, per=99.97%, avg=1343.00, stdev= 6.24, samples=40
   iops        : min=  164, max=  170, avg=167.82, stdev= 0.81, samples=40
  lat (msec)   : 10=0.06%, 20=7.38%, 50=92.56%
  cpu          : usr=0.08%, sys=2.82%, ctx=153295, majf=0, minf=528
  IO depths    : 1=0.1%, 2=0.1%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3362,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1343MiB/s (1409MB/s), 1343MiB/s-1343MiB/s (1409MB/s-1409MB/s), io=26.3GiB (28.2GB), run=20020-20020msec

Disk stats (read/write):
  nbd0: ios=213718/0, merge=0/0, ticks=4410063/0, in_queue=2522672, util=99.54%